https://dipbigdata.kr/pages/sub.htm?mode=view&mv_data=aWR4PTQyJnN0YXJ0UGFnZT0wJmxpc3RObz0yMyZ0YWJsZT1jc19vbmxpbmVfZGF0YSZzaXRlX2NvZGU9ZGlwJm5hdl9jb2RlPWRpcDE2NjY3NzE5OTYmY29kZT0mc2VhcmNoX2l0ZW09JnNlYXJjaF9vcmRlcj0mb3JkZXJfbGlzdD0mbGlzdF9zY2FsZT0mdmlld19sZXZlbD0mdmlld19jYXRlPeu5heuNsOydtO2EsOu2hOyEneq4sOyCrCZ2aWV3X2NhdGUyPQ==||

분류 문제

In [55]:
# 데이터 가져오기
import seaborn as sns
import pandas as pd
from sklearn.model_selection import train_test_split
df = sns.load_dataset('titanic')

# 학습, 평가 데이터 나누기
X_train,X_test,Y_train,Y_test = train_test_split(df,df['survived'],test_size=0.2,random_state=42,stratify=df['survived'])
X_train = X_train.drop(['alive','survived'],axis=1)
X_test = X_test.drop(['alive','survived'],axis=1)
print(X_train.head())

     pclass     sex   age  sibsp  parch      fare embarked   class    who  \
692       3    male   NaN      0      0   56.4958        S   Third    man
481       2    male   NaN      0      0    0.0000        S  Second    man
527       1    male   NaN      0      0  221.7792        S   First    man
855       3  female  18.0      0      1    9.3500        S   Third  woman
801       2  female  31.0      1      1   26.2500        S  Second  woman

     adult_male deck  embark_town  alone
692        True  NaN  Southampton   True
481        True  NaN  Southampton   True
527        True    C  Southampton   True
855       False  NaN  Southampton  False
801       False  NaN  Southampton  False

# 1. 결측치

In [56]:
df.isna().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

age, embarked, deck, embark_town 결측치 채우기

In [57]:
# age는 평균으로 채우기
X_train['age'] = X_train['age'].fillna(X_train['age'].mean())
X_test['age'] = X_test['age'].fillna(X_test['age'].mean())

In [58]:
# embarked 분포 보기
X_train['embarked'].value_counts()

embarked
S    516
C    139
Q     55
Name: count, dtype: int64

In [59]:
# 가장 많은 S로 채우기
X_train['embarked'] = X_train['embarked'].fillna('S')
X_test['embarked'] = X_test['embarked'].fillna('S')

In [60]:
# deck 분포 보기
print(X_train['deck'].value_counts())

deck
C    41
B    34
E    29
D    26
A    14
F    11
G     4
Name: count, dtype: int64

In [61]:
# 가장 많은 C로 채우기
X_train['deck'] = X_train['deck'].fillna('C')
X_test['deck'] = X_test['deck'].fillna('C')

In [62]:
# embark_town 분포 보기
print(X_train['embark_town'].value_counts())

embark_town
Southampton    516
Cherbourg      139
Queenstown      55
Name: count, dtype: int64

In [63]:
# 가장 많은 Southampton으로 채우기
X_train['embark_town'] = X_train['embark_town'].fillna('Southampton')
X_test['embark_town'] = X_test['embark_town'].fillna('Southampton')

In [64]:
X_train.isna().sum()

pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alone          0
dtype: int64

In [65]:
X_test.isna().sum()

pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alone          0
dtype: int64

# 2. 라벨인코딩

In [66]:
X_train.head()

,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alone
692,3,male,29.807687,0,0,56.4958,S,Third,man,True,C,Southampton,True
481,2,male,29.807687,0,0,0.0000,S,Second,man,True,C,Southampton,True
527,1,male,29.807687,0,0,221.7792,S,First,man,True,C,Southampton,True
855,3,female,18.000000,0,1,9.3500,S,Third,woman,False,C,Southampton,False
801,2,female,31.000000,1,1,26.2500,S,Second,woman,False,C,Southampton,False

In [67]:
X_train.columns

Index(['pclass', 'sex', 'age', 'sibsp', 'parch', 'fare', 'embarked', 'class',
       'who', 'adult_male', 'deck', 'embark_town', 'alone'],
      dtype='object')

In [68]:
from sklearn.preprocessing import LabelEncoder
label = ['sex','embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town', 'alone']
X_train[label] = X_train[label].apply(LabelEncoder().fit_transform)
X_test[label] = X_test[label].apply(LabelEncoder().fit_transform)

In [69]:
X_train.head()

,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alone
692,3,1,29.807687,0,0,56.4958,2,2,1,1,2,2,1
481,2,1,29.807687,0,0,0.0000,2,1,1,1,2,2,1
527,1,1,29.807687,0,0,221.7792,2,0,1,1,2,2,1
855,3,0,18.000000,0,1,9.3500,2,2,2,0,2,2,0
801,2,0,31.000000,1,1,26.2500,2,1,2,0,2,2,0

# 3. 데이터 타입변환, 더미

In [70]:
X_train.dtypes

pclass           int64
sex              int32
age            float64
sibsp            int64
parch            int64
fare           float64
embarked         int32
class            int32
who              int32
adult_male       int64
deck             int32
embark_town      int32
alone            int64
dtype: object

In [71]:
dtype = ['pclass','sex','class']
for i in dtype:
    X_train[i] = X_train[i].astype('category')
    X_test[i] = X_test[i].astype('category')
X_train = pd.get_dummies(X_train)
X_test = pd.get_dummies(X_test)

In [72]:
X_train.head()

,age,sibsp,parch,fare,embarked,who,adult_male,deck,embark_town,alone,pclass_1,pclass_2,pclass_3,sex_0,sex_1,class_0,class_1,class_2
692,29.807687,0,0,56.4958,2,1,1,2,2,1,False,False,True,False,True,False,False,True
481,29.807687,0,0,0.0000,2,1,1,2,2,1,False,True,False,False,True,False,True,False
527,29.807687,0,0,221.7792,2,1,1,2,2,1,True,False,False,False,True,True,False,False
855,18.000000,0,1,9.3500,2,2,0,2,2,0,False,False,True,True,False,False,False,True
801,31.000000,1,1,26.2500,2,2,0,2,2,0,False,True,False,True,False,False,True,False

# 4. 파생 변수

In [73]:
X_train['age_qcut'] = pd.qcut(X_train['age'],5,labels=False)
X_test['age_qcut'] = pd.qcut(X_test['age'],5,labels=False)

In [74]:
X_train.head()

,age,sibsp,parch,fare,embarked,who,adult_male,deck,embark_town,alone,pclass_1,pclass_2,pclass_3,sex_0,sex_1,class_0,class_1,class_2,age_qcut
692,29.807687,0,0,56.4958,2,1,1,2,2,1,False,False,True,False,True,False,False,True,2
481,29.807687,0,0,0.0000,2,1,1,2,2,1,False,True,False,False,True,False,True,False,2
527,29.807687,0,0,221.7792,2,1,1,2,2,1,True,False,False,False,True,True,False,False,2
855,18.000000,0,1,9.3500,2,2,0,2,2,0,False,False,True,True,False,False,False,True,0
801,31.000000,1,1,26.2500,2,2,0,2,2,0,False,True,False,True,False,False,True,False,3

# 5. 스케일

In [75]:
from sklearn.preprocessing import MinMaxScaler
scaler = ['age','fare']
m = MinMaxScaler()
m.fit(X_train[scaler])

X_train[scaler] = m.transform(X_train[scaler])
X_test[scaler] = m.transform(X_test[scaler])

In [76]:
X_train.head()

,age,sibsp,parch,fare,embarked,who,adult_male,deck,embark_town,alone,pclass_1,pclass_2,pclass_3,sex_0,sex_1,class_0,class_1,class_2,age_qcut
692,0.369285,0,0,0.110272,2,1,1,2,2,1,False,False,True,False,True,False,False,True,2
481,0.369285,0,0,0.000000,2,1,1,2,2,1,False,True,False,False,True,False,True,False,2
527,0.369285,0,0,0.432884,2,1,1,2,2,1,True,False,False,False,True,True,False,False,2
855,0.220910,0,1,0.018250,2,2,0,2,2,0,False,False,True,True,False,False,False,True,0
801,0.384267,1,1,0.051237,2,2,0,2,2,0,False,True,False,True,False,False,True,False,3

# 6. 데이터 분리 (학습, 검증)

In [77]:
X_train,X_valid,y_train,y_valid = train_test_split(X_train,Y_train,test_size=0.2,random_state=42,stratify=Y_train)

print(X_train.shape)
print(X_valid.shape)

(569, 19)
(143, 19)

# 7. 모형학습, 앙상블

In [78]:
from sklearn.linear_model import LogisticRegression
model1 = LogisticRegression()
model1.fit(X_train,y_train)
pred1 = pd.DataFrame(model1.predict_proba(X_valid))

In [79]:
from sklearn.ensemble import RandomForestClassifier
model2 = RandomForestClassifier()
model2.fit(X_train,y_train)
pred2 = pd.DataFrame(model2.predict_proba(X_valid))

In [80]:
# 보팅
from sklearn.ensemble import VotingClassifier
model3 = VotingClassifier(estimators=[('logistic',model1),('random',model2)],voting='soft')
model3.fit(X_train,y_train)
pred3 = pd.DataFrame(model3.predict_proba(X_valid))

In [81]:
pred3

            0         1
0    0.078043  0.921957
1    0.651500  0.348500
2    0.151603  0.848397
3    0.963914  0.036086
4    0.882562  0.117438
..        ...       ...
138  0.908729  0.091271
139  0.913741  0.086259
140  0.919785  0.080215
141  0.036754  0.963246
142  0.545406  0.454594

[143 rows x 2 columns]

# 9. 모형 평가

In [85]:
from sklearn.metrics import roc_auc_score
print('로지스틱',roc_auc_score(y_valid,pred1.iloc[:,1]))
print('랜덤',roc_auc_score(y_valid,pred2.iloc[:,1]))
print('보팅',roc_auc_score(y_valid,pred3.iloc[:,1]))

로지스틱 0.8594008264462811
랜덤 0.8481404958677685
보팅 0.8682851239669422

# 10. 하이퍼파라미터 튜닝

In [90]:
from sklearn.model_selection import GridSearchCV
parameters = {'n_estimators' : [50,100],
              'max_depth' : [4,6]}
model5 = RandomForestClassifier()
clf = GridSearchCV(estimator=model5, param_grid = parameters,cv=3)
clf.fit(X_train,y_train)
print('최적',clf.best_params_)

최적 {'max_depth': 6, 'n_estimators': 100}

# 11. 파일 저장

In [92]:
result = pd.DataFrame(model3.predict_proba(X_test))
result = result.iloc[:,1]
pd.DataFrame({'id':X_test.index,'result':result}).to_csv('연습문제1결과.csv',index=False)

In [93]:
check = pd.read_csv('연습문제1결과.csv')
check.head()

    id    result
0  565  0.132698
1  160  0.076274
2  553  0.081876
3  860  0.072123
4  241  0.740561